#ifndef __CAN_H
#define __CAN_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////
/************************************************
REMAP   |  00   | 01(1) | 11(2) |               |
********************************|               |
CAN1_RX | PA11  | (PB8) | (PD0) |               |
CAN1_TX | PA12  | (PB9) | (PD1) |               |
*********************************               |
CAN2_RX | PB12  |  PB5  |       |               |
CAN2_TX | PB13  |  PB6  |       |               |
************************************************|
(1)重映射不适用于36脚的封装                     |
(2)当PD0 和PD1 没有被重映射到OSC_IN和OSC_OUT 时,|
    重映射功能只适用于100 脚和144 脚的封装上    |
************************************************/
//////////////////////////////////////////////////////////////////////////////////

//CAN接收RX0中断使能
//0,不使能;1,使能.
#define CAN_RX0_INT_ENABLE  1
//复用使能
#define CAN_REMAP_ 1

//CAN初始化
u8 CAN_Mode_Init(u8 tsjw, u8 tbs2, u8 tbs1, u16 brp, u8 mode);
//发送数据
u8 Can_Send_Msg(u8 *msg, u8 len);
//接收数据
u8 Can_Receive_Msg(u8 *buf);
#endif

















